tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "shivammathur/php"
tap "warrensbox/tap"
brew "libpng"
brew "autoconf"
brew "automake"
brew "python@3.11"
brew "awscli"
brew "libssh2"
brew "bat"
brew "bison"
brew "freetype"
brew "gettext"
brew "glib"
brew "cmake"
brew "consul"
brew "curl"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "pango"
brew "srt"
brew "ffmpeg"
brew "figlet"
brew "freetds"
brew "fzf"
brew "gdk-pixbuf"
brew "git-filter-repo"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "librsvg"
brew "graphviz"
brew "gron"
brew "guile"
brew "highlight"
brew "htop"
brew "hugo"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "ipcalc"
brew "jless"
brew "jpeg", link: true
brew "jq"
brew "jsonnet"
brew "lazygit"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libzip"
brew "linode-cli"
brew "logcli"
brew "lua-language-server"
brew "luarocks"
brew "luv"
brew "lychee"
brew "markdown"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "nmap"
brew "node"
brew "nomad"
brew "packer"
brew "pandoc"
brew "postgresql@14"
brew "promtail"
brew "pv"
brew "python-lsp-server"
brew "python@3.10"
brew "python@3.8"
brew "ranger"
brew "re2c"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "step"
brew "stow"
brew "svgcleaner"
brew "syncthing", restart_service: true
brew "telnet"
brew "terraform", link: false
brew "terragrunt"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "yq"
brew "yt-dlp"
brew "zbar"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-native-comp"]
brew "hashicorp/tap/terraform-ls"
brew "warrensbox/tap/tfswitch"
cask "adobe-acrobat-reader"
cask "calibre"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "flux"
cask "inkscape"
cask "iterm2"
cask "licecap"
cask "loom"
cask "mactex"
cask "ngrok"
cask "obs"
cask "openra"
cask "postman"
cask "skype"
cask "spectacle"
cask "spotify"
cask "steam"
cask "uhk-agent"
cask "vagrant"
cask "vlc"
